{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv1D", "config": {"data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "kernel_size": [5], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "batch_input_shape": [null, 145, 4], "activity_regularizer": null, "trainable": true, "dtype": "float32", "filters": 120, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "epsilon": 0.001, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "kernel_size": [5], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "name": "conv1d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "activity_regularizer": null, "trainable": true, "filters": 120, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "epsilon": 0.001, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "kernel_size": [5], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "name": "conv1d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "activity_regularizer": null, "trainable": true, "filters": 120, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "epsilon": 0.001, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 12, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}