{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_1", "activity_regularizer": null, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 145, 4], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [3], "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 64, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [3]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 100, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [3]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 150, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [7]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_4", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 300, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [7]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [3], "name": "max_pooling1d_1", "trainable": true, "pool_size": [3]}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 200, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [7]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_6", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 200, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [3]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_7", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 200, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [3]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_8", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [4], "name": "max_pooling1d_2", "trainable": true, "pool_size": [4]}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "name": "conv1d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 200, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [7]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_9", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [4], "name": "max_pooling1d_3", "trainable": true, "pool_size": [4]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 100, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_10", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 12, "use_bias": true, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null}}]}